#hiragana to romaji dictionary
hiragana_all = [ "あ" , "い", "う", "え", "お",
                "か", "き", "く", "け", "こ",
                "が", "ぎ", "ぐ", "げ", "ご",
                "さ", "し", "す", "せ", "そ",
                "ざ", "じ", "ず", "ぜ", "ぞ",
                "た", "ち", "つ", "て", "と",
                "だ", "ぢ", "づ", "で", "ど",
                "な", "に", "ぬ", "ね", "の",
                "は", "ひ", "ふ", "へ", "ほ",
                "ば", "び", "ぶ", "べ", "ぼ",
                "ぱ", "ぴ", "ぷ", "ぺ", "ぽ",
                "ま", "み", "む", "め", "も",
                "ら", "り", "る", "れ", "ろ",
                "わ", "を","や", "ゆ", "よ", "ん",
                "きゃ", "きゅ", "きょ",
                "ぎゃ", "ぎゅ", "ぎょ",
                "しゃ", "しゅ", "しょ",
                "じゃ", "じゅ", "じょ",
                "ちゃ", "ちゅ", "ちょ",
                "にゃ", "にゅ", "にょ",
                "ひゃ", "ひゅ", "ひょ",
                "びゃ", "びゅ", "びょ",
                "ぴゃ", "ぴゅ", "ぴょ",
                "みゃ", "みゅ", "みょ",
                "りゃ", "りゅ", "りょ"
                ]
hiragana = {
    "あ": "a", "い": "i", "う": "u", "え": "e", "お": "o",

    "か": "ka", "き": "ki", "く": "ku", "け": "ke", "こ": "ko",
    "が": "ga", "ぎ": "gi", "ぐ": "gu", "げ": "ge", "ご": "go",

    "さ": "sa", "し": "shi", "す": "su", "せ": "se", "そ": "so",
    "ざ": "za", "じ": "ji", "ず": "zu", "ぜ": "ze", "ぞ": "zo",

    "た": "ta", "ち": "chi", "つ": "tsu", "て": "te", "と": "to",
    "だ": "da", "ぢ": "di", "づ": "du", "で": "de", "ど": "do",

    "な": "na", "に": "ni", "ぬ": "nu", "ね": "ne", "の": "no",

    "は": "ha", "ひ": "hi", "ふ": "fu", "へ": "he", "ほ": "ho",
    "ば": "ba", "び": "bi", "ぶ": "bu", "べ": "be", "ぼ": "bo",
    "ぱ": "pa", "ぴ": "pi", "ぷ": "pu", "ぺ": "pe", "ぽ": "po",

    "ま": "ma", "み": "mi", "む": "mu", "め": "me", "も": "mo",

    "ら": "ra", "り": "ri", "る": "ru", "れ": "re", "ろ": "ro",

    "わ": "wa", "を": "wo",

    "や": "ya", "ゆ": "yu", "よ": "yo", "ん": "nn"  
  
 }

hiragana_youon_base = {
    "き" : "ky", "ぎ" : "gy" ,
    "し" : "sh", "じ" : "j", 
    "ち" : "ch",
    "に" : "ny", 
    "ひ" : "hy", "び" : "by", "ぴ" : "py",
    "み" : "my",
    "り" : "ry"

}

hiragana_youon_small = {
    "ゃ": "a",
    "ゅ": "u",
    "ょ": "o"
}

#katakana to romaji dictionary
katakana_all = [
    "ア", "イ", "ウ", "エ", "オ",
    "カ", "キ", "ク", "ケ", "コ",
    "ガ", "ギ", "グ", "ゲ", "ゴ",
    "サ", "シ", "ス", "セ", "ソ",
    "ザ", "ジ", "ズ", "ゼ", "ゾ",
    "タ", "チ", "ツ", "テ", "ト",
    "ダ", "ヂ", "ヅ", "デ", "ド",
    "ナ", "ニ", "ヌ", "ネ", "ノ",
    "ハ", "ヒ", "フ", "ヘ", "ホ",
    "バ", "ビ", "ブ", "ベ", "ボ",
    "パ", "ピ", "プ", "ペ", "ポ",
    "マ", "ミ", "ム", "メ", "モ",
    "ラ", "リ", "ル", "レ", "ロ",
    "ワ", "ヲ", "ヤ", "ユ", "ヨ", "ン",

    "キャ", "キュ", "キョ",
    "ギャ", "ギュ", "ギョ",
    "シャ", "シュ", "ショ",
    "ジャ", "ジュ", "ジョ",
    "チャ", "チュ", "チョ",
    "ニャ", "ニュ", "ニョ",
    "ヒャ", "ヒュ", "ヒョ",
    "ビャ", "ビュ", "ビョ",
    "ピャ", "ピュ", "ピョ",
    "ミャ", "ミュ", "ミョ",
    "リャ", "リュ", "リョ"
]

katakana = {
    "ア": "a", "イ": "i", "ウ": "u", "エ": "e", "オ": "o",

    "カ": "ka", "キ": "ki", "ク": "ku", "ケ": "ke", "コ": "ko",
    "ガ": "ga", "ギ": "gi", "グ": "gu", "ゲ": "ge", "ゴ": "go",

    "サ": "sa", "シ": "shi", "ス": "su", "セ": "se", "ソ": "so",
    "ザ": "za", "ジ": "ji", "ズ": "zu", "ゼ": "ze", "ゾ": "zo",

    "タ": "ta", "チ": "chi", "ツ": "tsu", "テ": "te", "ト": "to",
    "ダ": "da", "ヂ": "di", "ヅ": "du", "デ": "de", "ド": "do",

    "ナ": "na", "ニ": "ni", "ヌ": "nu", "ネ": "ne", "ノ": "no",

    "ハ": "ha", "ヒ": "hi", "フ": "fu", "ヘ": "he", "ホ": "ho",
    "バ": "ba", "ビ": "bi", "ブ": "bu", "ベ": "be", "ボ": "bo",
    "パ": "pa", "ピ": "pi", "プ": "pu", "ペ": "pe", "ポ": "po",

    "マ": "ma", "ミ": "mi", "ム": "mu", "メ": "me", "モ": "mo",

    "ラ": "ra", "リ": "ri", "ル": "ru", "レ": "re", "ロ": "ro",

    "ワ": "wa", "ヲ": "wo", "ー": "-",

    "ヤ": "ya", "ユ": "yu", "ヨ": "yo", "ン": "nn"
}

katakana_youon_base = {
    "キ": "ky", "ギ": "gy",
    "シ": "sh", "ジ": "j",
    "チ": "ch",
    "ニ": "ny",
    "ヒ": "hy", "ビ": "by", "ピ": "py",
    "ミ": "my",
    "リ": "ry"
}

katakana_youon_small = {
    "ャ": "a",
    "ュ": "u",
    "ョ": "o"
}
